MISC/2023-03-19-to-mr2h-Strauss-report.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-19 日 11:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>いくつかの作品集を分離したい</title>
<meta name="author" content="和田勇" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">いくつかの作品集を分離したい</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgff301c3">1. いくつかの作品集を分離したい</a>
<ul>
<li><a href="#orgf32e4df">1.1. 要望と対応策</a>
<ul>
<li><a href="#org330cae9">1.1.1. 要望</a></li>
<li><a href="#org9cb4a8e">1.1.2. 対応策（原因）</a></li>
</ul>
</li>
<li><a href="#orge7e49f6">1.2. <code>[85%]</code><code>[6/7]</code> チェック</a>
<ul>
<li><a href="#org34ab573">1.2.1. <span class="done DONE">DONE</span> 1 ）Op.22の「見出し」をつくりたい。</a></li>
<li><a href="#orgb079efd">1.2.2. <span class="done DONE">DONE</span> 2 ）Op.66の「見出し」をつくりたい。</a></li>
<li><a href="#orgdc95cb8">1.2.3. <span class="todo TODO">TODO</span> 3 ）Op.67の「見出し」をつくりたい。</a></li>
<li><a href="#org9ad920b">1.2.4. <span class="done DONE">DONE</span> 4 ) Op.68の「見出し」をつくりたい。</a></li>
<li><a href="#org164ecd3">1.2.5. <span class="done DONE">DONE</span> 5 ) OP.71の「見出し」をつくりたい。</a></li>
<li><a href="#org5e5d5b8">1.2.6. <span class="done DONE">DONE</span> 6 ) Op.76の「見出し」をつくりたい。</a></li>
<li><a href="#org43d713c">1.2.7. <span class="done DONE">DONE</span> 7 ) Op.77の「見出し」をつくりたい。</a></li>
<li><a href="#org3a9cf68">1.2.8. <span class="todo TODO">TODO</span> 要望漏れ？最後の作品集です &#x2026; TrV 296, AV 150 &#x2026; Vier Letzte Lieder　４つの最後の歌</a></li>
</ul>
</li>
<li><a href="#org1bfe3f2">1.3. 処置方法</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgff301c3" class="outline-2">
<h2 id="orgff301c3"><span class="section-number-2">1.</span> いくつかの作品集を分離したい</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf32e4df" class="outline-3">
<h3 id="orgf32e4df"><span class="section-number-3">1.1.</span> 要望と対応策</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org330cae9" class="outline-4">
<h4 id="org330cae9"><span class="section-number-4">1.1.1.</span> 要望</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Op.22の4曲が、OP.21 Sehlichte Weisen のなかに包含されるなど、
いくつかの作品集が、合体しているので分離したい</li>
</ul>
</div>
</div>
<div id="outline-container-org9cb4a8e" class="outline-4">
<h4 id="org9cb4a8e"><span class="section-number-4">1.1.2.</span> 対応策（原因）</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>まとめページの処置で <b>SET</b> で始まる SECTION に反映させる見出し部分全部を無視していたため
要望にあるような症状が発生していたので、改修作業を行いました。</li>

<li>要望では７箇所でしたが、まとめページは９箇所あります
<ul class="org-ul">
<li>１つは最後の「Vier Letzte Lieder (TrV 296, AV 150) 4つの最後の歌 」で、チェック漏れだと思います。</li>
<li>もう１つは、 Op.67 TrV238 が二つあるためなのですが
<ul class="org-ul">
<li>整理番号が同じなの逆に合体させたいのでしょうか</li>
<li>そうであれば、この件に関しては機械的に処置した後、手作業です</li>
</ul></li>
</ul></li>

<li><p>
[参考] Strauss.htm から抜き出した情報
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">整理番号</td>
<td class="org-left">href（部分）</td>
<td class="org-left">作品名</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Op.22 TrV 153</td>
<td class="org-left">../TEXT/SET2534.htm</td>
<td class="org-left">Mädchenblumen　乙女の花</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Op.66 TrV 236</td>
<td class="org-left">../TEXT/SET1657.htm</td>
<td class="org-left">Krämerspiegel　商人の鑑</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left"><b>Op.67 TrV 238</b></td>
<td class="org-left">../TEXT/SET1957.htm</td>
<td class="org-left">3 Lieder der Ophelia　３つのオフィーリアの歌</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left"><b>Op.67 TrV 238</b></td>
<td class="org-left">../TEXT/SET1959.htm</td>
<td class="org-left">3 Lieder aus den Büchern des Unmuts des Rendsch Nameh</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">不機嫌の書よりの３つの歌曲</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Op.68 TrV 235</td>
<td class="org-left">../TEXT/SET2145.htm</td>
<td class="org-left">Sechs Lieder nach Gedichten von Clemens Brentano</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">クレメンス・ブレンターノの詩による６つの歌曲</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">Op.71 TrV 240</td>
<td class="org-left">../TEXT/SET4419.htm</td>
<td class="org-left">Drei Hymnen von Friedrich Hölderlin</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">フリードリヒ・ヘルダーリンの3つの讃歌</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Op.76 TrV 256</td>
<td class="org-left">../TEXT/SET4461.htm</td>
<td class="org-left">Die Tageszeiten　日々のうつろい</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">Op.77 TrV 257</td>
<td class="org-left">../TEXT/SET4554.htm</td>
<td class="org-left">Gesänge des Orients　オリエントの歌</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left"><b>TrV 296, AV 150</b></td>
<td class="org-left">../TEXT/SET386.htm</td>
<td class="org-left">Vier Letzte Lieder　４つの最後の歌</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge7e49f6" class="outline-3">
<h3 id="orge7e49f6"><span class="section-number-3">1.2.</span> <code>[85%]</code><code>[6/7]</code> チェック</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>TODO</b> のところを重点的に検討してください。
</p>
</div>

<div id="outline-container-org34ab573" class="outline-4">
<h4 id="org34ab573"><span class="section-number-4">1.2.1.</span> <span class="done DONE">DONE</span> 1 ）Op.22の「見出し」をつくりたい。</h4>
<div class="outline-text-4" id="text-1-2-1">
<pre class="example">
Mädchenblumen 乙女の花 (Op.22 TrV 153) (1886-88) 詞:ダーン
    1 Kornblumen (Op.22-1 TrV 153) 矢車菊
    2 Mohnblumen (Op.22-2 TrV 153) ポピー
    3 Epheu (Op.22-3 TrV 153) 木づた
    4 Wasserrose (Op.22-4 TrV 153) スイレン
</pre>
</div>
</div>
<div id="outline-container-orgb079efd" class="outline-4">
<h4 id="orgb079efd"><span class="section-number-4">1.2.2.</span> <span class="done DONE">DONE</span> 2 ）Op.66の「見出し」をつくりたい。</h4>
<div class="outline-text-4" id="text-1-2-2">
<pre class="example">
Krämerspiegel 商人の鑑 Op.66 TrV 236(1918)詞:ケル
    1 Es war einmal ein Bock　昔　一匹の牡山羊が　(Op.66-1 TrV 236)
    2 Einst kam der Bock als Bote　あるとき牡山羊が使者になり　(Op.66-2 TrV236)
    3 Es liebte einst ein Hase　昔　ウサギが惚れ込んだ　(Op.66-3 TrV 236)
    4 Drei Masken sah ich　三つの仮面を私は見た　(Op.66-4 TrV 236)
    5 Hast du ein Tongedicht vollbracht　曲ができたなら　(Op.66-5 TrV 236)
    6 O lieber Künstler sei ermahnt　おお芸術家たちよ気を付けよ　(Op.66-6 TrV 236)
    7 Unser Feind ist，grosser Gott　神様よ　我らが敵は　(Op.66-7 TrV 236)
    8 Von Händlern wird die Kunst bedroht　商人は芸術を食い荒らし　(Op.66-8 TrV 236)
    9 Es war mal eine Wanze　昔一匹の毛虱が　(Op.66-9 TrV 236)
    10 Die Künstler sind die Schöpfer　芸術家は創造者　(Op.66-10 TrV 236)
    11 Die Händler und die Macher　商人とその元締めは　(Op.66-11 TrV 236)
    12 O Schröpferschwarm　おお　銭取り虫の群れよ　(Op.66-12 TrV 236)
</pre>
</div>
</div>
<div id="outline-container-orgdc95cb8" class="outline-4">
<h4 id="orgdc95cb8"><span class="section-number-4">1.2.3.</span> <span class="todo TODO">TODO</span> 3 ）Op.67の「見出し」をつくりたい。</h4>
<div class="outline-text-4" id="text-1-2-3">
<pre class="example">
3 Lieder der Ophelia ３つのオｆヒーリアの歌 Op.67 TrV238(1918):詞:ジムロ　
    1 Wie erkenn' ich mein Treulieb　どうやって見分けるの　本当の恋人を　(Op.67-1 TrV238)
    2 Guten Morgen，'s ist Sankt Valentinstag　おはよう、今日はバレンタインデーよ　(Op.67-2 TrV238)
    3 Sie trugen ihn auf der Bahre bloss　あの人は死化粧もせずに棺に入れられた　(Op.67-3 TrV238)
</pre>
<pre class="example">
3 Lieder aus den Büchrn des Unmuts des Rendsch Nameh 不機嫌の書よりの３つの歌曲 Op.67 TrV238(1918)詞:ゲーテ
    1 Wer wird von der Welt verlangen　この世間に対して誰が期待するというのだ Op.67-4 TrV238
    2 Hab' ich euch denn je geraten　私が今までお前たちに指図などしたことがあるか Op.67-5 TrV238
    3 Wanderers Gemütsruhe　さすらい人の心のやすらぎ Op.67-6 TrV238
</pre>
</div>
</div>
<div id="outline-container-org9ad920b" class="outline-4">
<h4 id="org9ad920b"><span class="section-number-4">1.2.4.</span> <span class="done DONE">DONE</span> 4 ) Op.68の「見出し」をつくりたい。</h4>
<div class="outline-text-4" id="text-1-2-4">
<pre class="example">
Sechs Lieder nach Gedichten von Clemens Brentano クレメンス・ブレンターノの詩による６つの歌曲 Op.68 TrV 235(1918)詞:ブレンターノ
    1 An die Nacht　夜　Op.68-1 TrV 235
    2 Ich wollt ein Sträußlein binden　わたしは一本の花束を作りたかったの　Op.68-2 TrV 235
    3 Säusle，liebe Myrte　こんにちは、愛らしいミルテよ　Op.68-3 TrV 235
    4 Als mir dein Lied erklang　私にあなたの歌が響いたとき　Op.68-4 TrV 235
    5 Amor　アモール　Op.68-5 TrV 235
    6 Lied der Frauen　女たちの歌　Op.68-6 TrV 235
</pre>
</div>
</div>
<div id="outline-container-org164ecd3" class="outline-4">
<h4 id="org164ecd3"><span class="section-number-4">1.2.5.</span> <span class="done DONE">DONE</span> 5 ) OP.71の「見出し」をつくりたい。</h4>
<div class="outline-text-4" id="text-1-2-5">
<pre class="example">
Drei Hymnen von Friedrich Hölderlin フリードリヒ・ヘルダーリンの３つの賛歌 Op.71 TrV 240(1921)詞:ヘルダーリン
    1 Hymne an die Liebe　愛に寄せる讃歌　Op.71-1 TrV 240
    2 Rückkehr in die Heimat　帰郷　Op.71-2 TrV 240
    3 Die Liebe　愛　Op.71-3 TrV 240
</pre>
</div>
</div>
<div id="outline-container-org5e5d5b8" class="outline-4">
<h4 id="org5e5d5b8"><span class="section-number-4">1.2.6.</span> <span class="done DONE">DONE</span> 6 ) Op.76の「見出し」をつくりたい。</h4>
<div class="outline-text-4" id="text-1-2-6">
<pre class="example">
Die Tageszeiten 日々のうつろい Op.76 TrV 256(1928)詞:アイヒェンドルフ
  1 Der Morgen　朝　Op.76-1 TrV 256
  2 Mittagsruh　真昼の憩い　Op.76-2 TrV 256
  3 Der Abend　夕暮れ　Op.76-3 TrV 256
  4 Die Nacht　夜　Op.76-4 TrV 256
</pre>
</div>
</div>
<div id="outline-container-org43d713c" class="outline-4">
<h4 id="org43d713c"><span class="section-number-4">1.2.7.</span> <span class="done DONE">DONE</span> 7 ) Op.77の「見出し」をつくりたい。</h4>
<div class="outline-text-4" id="text-1-2-7">
<pre class="example">
Gesänge des Orients オリエントの歌 Op.77 TrV 257(1928)詞:ベートゲ原詩:ハーフィズ
    1 Ihre Augen　彼女の瞳 Op.77-1 TrV 257
    2 Schwung　活気 Op.77-2 TrV 257
    3 Liebesgeschenke　愛の贈り物 Op.77-3 TrV 257
    4 Die Allmächtige　全能なる者 Op.77-4 TrV 257
    5 Huldigung　誓い Op.77-5 TrV 257
</pre>
</div>
</div>
<div id="outline-container-org3a9cf68" class="outline-4">
<h4 id="org3a9cf68"><span class="section-number-4">1.2.8.</span> <span class="todo TODO">TODO</span> 要望漏れ？最後の作品集です &#x2026; TrV 296, AV 150 &#x2026; Vier Letzte Lieder　４つの最後の歌</h4>
</div>
</div>

<div id="outline-container-org1bfe3f2" class="outline-3">
<h3 id="org1bfe3f2"><span class="section-number-3">1.3.</span> 処置方法</h3>
<div class="outline-text-3" id="text-1-3">
<p>
EDIT/Strauss 直下のファイルを手作業で対応するのは大変なので、
和田の <a href="https://github.com/128Mac/lyricssongs">https://github.com/128Mac/lyricssongs</a> から clone した
lyricssongs のディレクトリで、再度、 Strauss 以下を再作成しましょう。
</p>

<ol class="org-ol">
<li><p>
作業ディレクトリ
</p>

<p>
作業は lyricssongs ディレクトリで行なってください。
</p></li>

<li>git status で clean な状態であることを確認</li>

<li><p>
git fetch / pull
</p>

<p>
今回の修正は scripts/21-lyricssongs-tex-gen.rb ですので
それが以下のように pull できていることを確認してください
</p>

<pre class="example">
Updating ... 省略 ...
...
 scripts/21-lyricssongs-tex-gen.rb   ... 省略
...
</pre>

<ul class="org-ul">
<li>参考 &#x2026;最終変更の変更内容を確認したい時は git show を使ってください</li>
</ul></li>

<li>Strauss ディレクトリが存在したら削除</li>

<li><p>
Strauss 関連 .htm を .tex に変換し Strauss ディレクトリのリポジトリに登録
</p>

<div class="org-src-container">
<pre class="src src-bash">ruby scripts/21-lyricssongs-tex-gen.rb
ruby scripts/21-lyricssongs-tex-gen.rb
</pre>
</div></li>

<li>「llmk Strauss/Strauss」で pdf 作成</li>
<li>目次部分で最低限のチェック
<ul class="org-ul">
<li>対象となった作品集が分離されたか確認</li>
</ul></li>

<li>OK であれば EDIT/Strauss を削除して、Srauss を EDIT へ移動させチェックや修正を行なってください。</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 和田勇</p>
<p class="date">Created: 2023-03-19 日 11:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>